; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image0 - mode
	image2 - mode
	spectrograph3 - mode
	image1 - mode
	Star2 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star4 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image1)
	(supports instrument1 spectrograph3)
	(supports instrument1 image0)
	(calibration_target instrument1 Star2)
	(supports instrument2 spectrograph3)
	(supports instrument2 image2)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 178)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 image1)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 155)
	(= (data Star4 image0) 253)
	(= (data Planet5 image0) 93)
	(= (data Planet6 image0) 180)
	(= (data Planet7 image0) 281)
	(= (data Star4 image2) 108)
	(= (data Planet5 image2) 191)
	(= (data Planet6 image2) 114)
	(= (data Planet7 image2) 15)
	(= (data Star4 spectrograph3) 237)
	(= (data Planet5 spectrograph3) 176)
	(= (data Planet6 spectrograph3) 252)
	(= (data Planet7 spectrograph3) 274)
	(= (data Star4 image1) 48)
	(= (data Planet5 image1) 216)
	(= (data Planet6 image1) 154)
	(= (data Planet7 image1) 150)
	(= (slew_time Star2 GroundStation0) 84.01)
	(= (slew_time GroundStation0 Star2) 84.01)
	(= (slew_time Star2 GroundStation1) 1.004)
	(= (slew_time GroundStation1 Star2) 1.004)
	(= (slew_time GroundStation3 GroundStation0) 76.96)
	(= (slew_time GroundStation0 GroundStation3) 76.96)
	(= (slew_time GroundStation3 GroundStation1) 21.02)
	(= (slew_time GroundStation1 GroundStation3) 21.02)
	(= (slew_time GroundStation3 Star2) 72.94)
	(= (slew_time Star2 GroundStation3) 72.94)
	(= (slew_time GroundStation1 GroundStation0) 5.265)
	(= (slew_time GroundStation0 GroundStation1) 5.265)
	(= (slew_time Star4 GroundStation0) 66.45)
	(= (slew_time GroundStation0 Star4) 66.45)
	(= (slew_time Star4 GroundStation1) 26.21)
	(= (slew_time GroundStation1 Star4) 26.21)
	(= (slew_time Star4 Star2) 98.19)
	(= (slew_time Star2 Star4) 98.19)
	(= (slew_time Star4 GroundStation3) 34.31)
	(= (slew_time GroundStation3 Star4) 34.31)
	(= (slew_time Planet5 GroundStation0) 14.56)
	(= (slew_time GroundStation0 Planet5) 14.56)
	(= (slew_time Planet5 GroundStation1) 1.11)
	(= (slew_time GroundStation1 Planet5) 1.11)
	(= (slew_time Planet5 Star2) 6.623)
	(= (slew_time Star2 Planet5) 6.623)
	(= (slew_time Planet5 GroundStation3) 49.57)
	(= (slew_time GroundStation3 Planet5) 49.57)
	(= (slew_time Planet5 Star4) 22.93)
	(= (slew_time Star4 Planet5) 22.93)
	(= (slew_time Planet6 GroundStation0) 9.538)
	(= (slew_time GroundStation0 Planet6) 9.538)
	(= (slew_time Planet6 GroundStation1) 24.39)
	(= (slew_time GroundStation1 Planet6) 24.39)
	(= (slew_time Planet6 Star2) 69)
	(= (slew_time Star2 Planet6) 69)
	(= (slew_time Planet6 GroundStation3) 64.73)
	(= (slew_time GroundStation3 Planet6) 64.73)
	(= (slew_time Planet6 Star4) 39.26)
	(= (slew_time Star4 Planet6) 39.26)
	(= (slew_time Planet6 Planet5) 21.55)
	(= (slew_time Planet5 Planet6) 21.55)
	(= (slew_time Planet7 GroundStation0) 21.9)
	(= (slew_time GroundStation0 Planet7) 21.9)
	(= (slew_time Planet7 GroundStation1) 6.688)
	(= (slew_time GroundStation1 Planet7) 6.688)
	(= (slew_time Planet7 Star2) 27.88)
	(= (slew_time Star2 Planet7) 27.88)
	(= (slew_time Planet7 GroundStation3) 59.68)
	(= (slew_time GroundStation3 Planet7) 59.68)
	(= (slew_time Planet7 Star4) 9.985)
	(= (slew_time Star4 Planet7) 9.985)
	(= (slew_time Planet7 Planet5) 72.06)
	(= (slew_time Planet5 Planet7) 72.06)
	(= (slew_time Planet7 Planet6) 28.67)
	(= (slew_time Planet6 Planet7) 28.67)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star4 image2)
	(have_image Planet5 spectrograph3)
	(have_image Planet6 image0)
	(have_image Planet7 image1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star2 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 178 to 105.06, (fuel-used) from 0 to 72.94
   goals met: 0 of 4
2. (turn_to satellite0 groundstation1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 105.06 to 104.056, (fuel-used) from 72.94 to 73.944
   goals met: 0 of 4
3. (turn_to satellite0 star2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 104.056 to 103.052, (fuel-used) from 73.944 to 74.948
   goals met: 0 of 4
4. (turn_to satellite0 groundstation1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 103.052 to 102.048, (fuel-used) from 74.948 to 75.952
   goals met: 0 of 4
5. (turn_to satellite0 planet5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 102.048 to 100.938, (fuel-used) from 75.952 to 77.062
   goals met: 0 of 4
6. (turn_to satellite0 groundstation1 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 100.938 to 99.828, (fuel-used) from 77.062 to 78.172
   goals met: 0 of 4
7. (turn_to satellite0 star2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 99.828 to 98.824, (fuel-used) from 78.172 to 79.176
   goals met: 0 of 4
8. (turn_to satellite0 groundstation1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 98.824 to 97.82, (fuel-used) from 79.176 to 80.18
   goals met: 0 of 4
9. (turn_to satellite0 star2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 97.82 to 96.816, (fuel-used) from 80.18 to 81.184
   goals met: 0 of 4
10. (turn_to satellite0 groundstation1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 96.816 to 95.812, (fuel-used) from 81.184 to 82.188
   goals met: 0 of 4
11. (turn_to satellite0 star2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 95.812 to 94.808, (fuel-used) from 82.188 to 83.192
   goals met: 0 of 4
12. (turn_to satellite0 groundstation1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 94.808 to 93.804, (fuel-used) from 83.192 to 84.196
   goals met: 0 of 4
13. (turn_to satellite0 star2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 93.804 to 92.8, (fuel-used) from 84.196 to 85.2
   goals met: 0 of 4
14. (turn_to satellite0 groundstation1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 92.8 to 91.796, (fuel-used) from 85.2 to 86.204
   goals met: 0 of 4
15. (turn_to satellite0 star2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 91.796 to 90.792, (fuel-used) from 86.204 to 87.208
   goals met: 0 of 4
16. (turn_to satellite0 groundstation1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 90.792 to 89.788, (fuel-used) from 87.208 to 88.212
   goals met: 0 of 4
17. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 4
18. (turn_to satellite0 star2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 89.788 to 88.784, (fuel-used) from 88.212 to 89.216
   goals met: 0 of 4
19. (turn_to satellite0 planet7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 88.784 to 60.904, (fuel-used) from 89.216 to 117.096
   goals met: 0 of 4
20. (turn_to satellite0 groundstation1 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 60.904 to 54.216, (fuel-used) from 117.096 to 123.784
   goals met: 0 of 4
21. (turn_to satellite0 star2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 54.216 to 53.212, (fuel-used) from 123.784 to 124.788
   goals met: 0 of 4
22. (turn_to satellite0 groundstation1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 53.212 to 52.208, (fuel-used) from 124.788 to 125.792
   goals met: 0 of 4
23. (turn_to satellite0 star2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 52.208 to 51.204, (fuel-used) from 125.792 to 126.796
   goals met: 0 of 4
24. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 4
25. (turn_to satellite0 groundstation1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 51.204 to 50.2, (fuel-used) from 126.796 to 127.8
   goals met: 0 of 4
26. (turn_to satellite0 planet5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 50.2 to 49.09, (fuel-used) from 127.8 to 128.91
   goals met: 0 of 4
27. (take_image satellite0 planet5 instrument1 spectrograph3)
   added: (have_image planet5 spectrograph3)
   changed: (data_capacity satellite0) from 1000 to 824, (data-stored) from 0 to 176
   goals met: 1 of 4
28. (turn_to satellite0 groundstation1 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 49.09 to 47.98, (fuel-used) from 128.91 to 130.02
   goals met: 1 of 4
29. (turn_to satellite0 groundstation0 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 47.98 to 42.715, (fuel-used) from 130.02 to 135.285
   goals met: 1 of 4
30. (turn_to satellite0 planet6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 42.715 to 33.177, (fuel-used) from 135.285 to 144.823
   goals met: 1 of 4
31. (take_image satellite0 planet6 instrument1 image0)
   added: (have_image planet6 image0)
   changed: (data_capacity satellite0) from 824 to 644, (data-stored) from 176 to 356
   goals met: 2 of 4
32. (turn_to satellite0 groundstation0 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 33.177 to 23.639, (fuel-used) from 144.823 to 154.361
   goals met: 2 of 4
33. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 4
34. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 4
35. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 2 of 4
36. (turn_to satellite0 groundstation1 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 23.639 to 18.374, (fuel-used) from 154.361 to 159.626
   goals met: 2 of 4
37. (turn_to satellite0 planet7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 18.374 to 11.686, (fuel-used) from 159.626 to 166.314
   goals met: 2 of 4
38. (take_image satellite0 planet7 instrument2 image1)
   added: (have_image planet7 image1)
   changed: (data_capacity satellite0) from 644 to 494, (data-stored) from 356 to 506
   goals met: 3 of 4
39. (turn_to satellite0 star4 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 11.686 to 1.701, (fuel-used) from 166.314 to 176.299
   goals met: 3 of 4
40. (take_image satellite0 star4 instrument2 image2)
   added: (have_image star4 image2)
   changed: (data_capacity satellite0) from 494 to 386, (data-stored) from 506 to 614
   goals met: 4 of 4
